NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_packet_buffer.c
/* Test edge case where head == tail and there's not enough space left in the buffer to fit the
 * new packet.
 */
void test_packet_buffer_empty_near_end(void)
{
    const uint32_t packet_header_size = sizeof(packet_buffer_packet_t);
    packet_buffer_t my_pacman;
    packet_buffer_packet_t * p_my_packet;

    packet_buffer_init(&my_pacman, memory_block, MEM_BLOCK_SIZE);

    const uint16_t remaining_size = packet_header_size + 4;

    struct
    {
        uint16_t size;
        uint16_t expected_offset; /**< Expected offset of the returned packet */
        bool succeed;
    } vectors[] = {
        {remaining_size, 0, true}, /* will not fit because of the header, must wrap around. */
        {remaining_size - packet_header_size, MEM_BLOCK_SIZE - remaining_size, true}, /* will fit perfectly */
        {remaining_size + 4, 0, true}, /* too big, must wrap around */
        {MEM_BLOCK_SIZE - (packet_header_size * 2) - remaining_size, 0, true}, /* Should fit after wrap around */
        {MEM_BLOCK_SIZE - packet_header_size, 0, false} /* Won't fit, as there's no room before the tail */
    };
    for (uint32_t i = 0; i < ARRAY_SIZE(vectors); i++)
    {
        char fail_msg[128];
        sprintf(fail_msg, "Failed at iteration %d, size is %d", i, vectors[i].size);
        my_pacman.head = MEM_BLOCK_SIZE - remaining_size;
        my_pacman.tail = MEM_BLOCK_SIZE - remaining_size;
        packet_buffer_packet_t * p_current_head = ((packet_buffer_packet_t *)&memory_block[my_pacman.head]);
        p_current_head->packet_state = PACKET_BUFFER_MEM_STATE_FREE;

        uint32_t status = packet_buffer_reserve(&my_pacman, &p_my_packet, vectors[i].size);

        /* Should reset head and tail to 0 regardless: */
        TEST_ASSERT_EQUAL_MESSAGE(0, (uint8_t *)p_my_packet - memory_block, fail_msg);
        TEST_ASSERT_EQUAL_MESSAGE(NRF_SUCCESS, status, fail_msg);
        packet_buffer_commit(&my_pacman, p_my_packet, vectors[i].size);
    }

    /* Test the same vector, but now, have one small packet committed first, to prevent resetting the buffer. */
    for (uint32_t i = 0; i < ARRAY_SIZE(vectors); i++)
    {
        char fail_msg[128];
        sprintf(fail_msg, "Failed at iteration %d, size is %d", i, vectors[i].size);
        my_pacman.head = MEM_BLOCK_SIZE - remaining_size;
        my_pacman.tail = MEM_BLOCK_SIZE - remaining_size - packet_header_size;
        packet_buffer_packet_t * p_current_head = ((packet_buffer_packet_t *)&memory_block[my_pacman.head]);
        p_current_head->packet_state = PACKET_BUFFER_MEM_STATE_FREE;

        uint32_t status = packet_buffer_reserve(&my_pacman, &p_my_packet, vectors[i].size);

        if (vectors[i].succeed)
        {
            TEST_ASSERT_EQUAL_MESSAGE(vectors[i].expected_offset, (uint8_t *)p_my_packet - memory_block, fail_msg);
            TEST_ASSERT_EQUAL_MESSAGE(NRF_SUCCESS, status, fail_msg);
            packet_buffer_commit(&my_pacman, p_my_packet, vectors[i].size);
        }
        else
        {
            TEST_ASSERT_EQUAL_MESSAGE(NRF_ERROR_NO_MEM, status, fail_msg);
        }
    }
}

void test_packet_buffer_flush(void)
{
    packet_buffer_t my_pacman;
    packet_buffer_packet_t * p_packet;

    packet_buffer_init(&my_pacman, memory_block, MEM_BLOCK_SIZE);

    uint8_t lengths[] = {8, 4, 13, 1, 12};

    /***** Empty buffer *****/
    packet_buffer_flush(&my_pacman);
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, packet_buffer_pop(&my_pacman, &p_packet));

    /***** No popped, no reserved packets *****/
    for (uint32_t i = 0; i < sizeof(lengths); ++i)
    {
        TEST_ASSERT_EQUAL(NRF_SUCCESS, packet_buffer_reserve(&my_pacman, &p_packet, lengths[i]));
        packet_buffer_commit(&my_pacman, p_packet, lengths[i]);
    }

    packet_buffer_flush(&my_pacman);

    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, packet_buffer_pop(&my_pacman, &p_packet));

    /* No popped packets, one reserved packet */
    for (uint32_t i = 0; i < sizeof(lengths); ++i)
    {
        TEST_ASSERT_EQUAL(NRF_SUCCESS, packet_buffer_reserve(&my_pacman, &p_packet, lengths[i]));
        packet_buffer_commit(&my_pacman, p_packet, lengths[i]);
    }
    TEST_ASSERT_EQUAL(NRF_SUCCESS, packet_buffer_reserve(&my_pacman, &p_packet, 10));

    TEST_NRF_MESH_ASSERT_EXPECT(packet_buffer_flush(&my_pacman));

    /* reset: */
    packet_buffer_init(&my_pacman, memory_block, MEM_BLOCK_SIZE);
    /***** one popped packet, no reserved packets *****/
    for (uint32_t i = 0; i < sizeof(lengths); ++i)
    {
        TEST_ASSERT_EQUAL(NRF_SUCCESS, packet_buffer_reserve(&my_pacman, &p_packet, lengths[i]));
        packet_buffer_commit(&my_pacman, p_packet, lengths[i]);
    }
    TEST_ASSERT_EQUAL(NRF_SUCCESS, packet_buffer_pop(&my_pacman, &p_packet));

    packet_buffer_flush(&my_pacman);

    packet_buffer_free(&my_pacman, p_packet);
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, packet_buffer_pop(&my_pacman, &p_packet));
    /* Verify that we can reserve+free again */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, packet_buffer_reserve(&my_pacman, &p_packet, 10));
    packet_buffer_free(&my_pacman, p_packet);
}

/**
 * Testing max packet size lockup regression.
 *
 * An empty buffer should always be able to allocate a max-len packet.
 */
void test_maxlen_alloc_lockup(void)
{
    packet_buffer_t my_pacman;
    packet_buffer_packet_t * p_packet;

    packet_buffer_init(&my_pacman, memory_block, MEM_BLOCK_SIZE);

    uint32_t maxlen = packet_buffer_max_packet_len_get(&my_pacman);

    /* maxlen alloc on untouched buffer */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, packet_buffer_reserve(&my_pacman, &p_packet, maxlen));
    packet_buffer_free(&my_pacman, p_packet);


    /* Previous regression: if the head and tail of an empty buffer is somewhere other than at 0,
     * the buffer would fail allocation of max-length packets, even though there's technically
     * space. */

    TEST_ASSERT_EQUAL(NRF_SUCCESS, packet_buffer_reserve(&my_pacman, &p_packet, maxlen / 2));
    packet_buffer_commit(&my_pacman, p_packet, p_packet->size);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, packet_buffer_pop(&my_pacman, &p_packet));
    packet_buffer_free(&my_pacman, p_packet);

