NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_packet_buffer.c
    /* Head and tail should now be in the middle of the buffer, but the buffer is empty. Should still succeed alloc of maxlen */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, packet_buffer_reserve(&my_pacman, &p_packet, maxlen));

}

void test_ready_to_pop(void)
{
    packet_buffer_t my_pacman;
    packet_buffer_packet_t * p_reserve_packet;
    packet_buffer_packet_t * p_pop_packet;

    packet_buffer_init(&my_pacman, memory_block, MEM_BLOCK_SIZE);

    /* Empty buffer */
    TEST_ASSERT_FALSE(packet_buffer_packets_ready_to_pop(&my_pacman));

    /* Sending packets A, B and C through the buffer, only expect ready_to_pop being true when
     * there's at least one committed packet somewhere in the buffer. */

    /* Push packet A */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, packet_buffer_reserve(&my_pacman, &p_reserve_packet, 10));
    packet_buffer_commit(&my_pacman, p_reserve_packet, p_reserve_packet->size);
    /* Push packet B */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, packet_buffer_reserve(&my_pacman, &p_reserve_packet, 10));
    packet_buffer_commit(&my_pacman, p_reserve_packet, p_reserve_packet->size);

    /* Packet A in committed state */
    TEST_ASSERT_TRUE(packet_buffer_packets_ready_to_pop(&my_pacman));

    TEST_ASSERT_EQUAL(NRF_SUCCESS, packet_buffer_pop(&my_pacman, &p_pop_packet));
    /* Packet A in popped state, Packet B in committed state */
    TEST_ASSERT_TRUE(packet_buffer_packets_ready_to_pop(&my_pacman));

    /* Free packet A, packet B still in committed state */
    packet_buffer_free(&my_pacman, p_pop_packet);
    TEST_ASSERT_TRUE(packet_buffer_packets_ready_to_pop(&my_pacman));

    TEST_ASSERT_EQUAL(NRF_SUCCESS, packet_buffer_pop(&my_pacman, &p_pop_packet));
    /* Packet B in popped state, No more packets allocated. */
    TEST_ASSERT_FALSE(packet_buffer_packets_ready_to_pop(&my_pacman));

    /* Reserve packet C */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, packet_buffer_reserve(&my_pacman, &p_reserve_packet, 10));
    /* Packet B in popped state, Packet C in reserved */
    TEST_ASSERT_FALSE(packet_buffer_packets_ready_to_pop(&my_pacman));

    /* Free packet B */
    packet_buffer_free(&my_pacman, p_pop_packet);

    /* Packet C still in reserved state */
    TEST_ASSERT_FALSE(packet_buffer_packets_ready_to_pop(&my_pacman));
}
